# # Решение через list
# n = int(input('Введите номер месяца от 1 до 12: '))
# winter = [1, 2, 12]
# spring = [3, 4, 5]
# summer = [6, 7, 8]
# autumn = [9, 10, 11]
#
# if n in winter:
#     print("Это зима")
# elif n in spring:
#     print("Это весна")
# elif n in summer:
#     print("Это лето")
# elif n in autumn:
#     print("Это осень")
# else:
#     print('Ошибка')
#
# # Решение через dict
# n = int(input('Введите номер месяца от 1 до 12: '))
# dict = {
#         1: 'зима',
#         2: 'зима',
#         3: 'весна',
#         4: 'весна',
#         5: 'весна',
#         6: 'лето',
#         7: 'лето',
#         8: 'лето',
#         9: 'осень',
#         10: 'осень',
#         11: 'осень',
#         12: 'зима'
# }
# print('Это', dict[n])

# Решение через с названиями месяцев
n = int(input('Введите номер месяца от 1 до 12: '))
months = {
        1: 'январь',
        2: 'февраль',
        3: 'март',
        4: 'апрель',
        5: 'май',
        6: 'июнь',
        7: 'июль',
        8: 'август',
        9: 'сентябрь',
        10: 'октябрь',
        11: 'ноябрь',
        12: 'декабрь'
}

if n in [1, 2, 12]:
    season = 'зима'
elif n in [3, 4, 5]:
    season = 'весна'
elif n in [6, 7, 8]:
    season = 'лето'
elif n in [9, 10, 11]:
    season = 'лето'
else:
    print('Ошибка')

print(f'Месяц № {n} , {months[n]} - это {season}')

